# ApplicationClosingEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ApplicationClosingEventArgs Class
Members See Also
---
The event arguments used by the ApplicationClosing event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ApplicationClosingEventArgs : RevitAPIPreEventArgs
```

Visual Basic
---
```text
Public Class ApplicationClosingEventArgs _
	Inherits RevitAPIPreEventArgs
```

Visual C++
---
```text
public ref class ApplicationClosingEventArgs : public RevitAPIPreEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.UI.Events..::..ApplicationClosingEventArgs
# See Also
ApplicationClosingEventArgs Members
Autodesk.Revit.UI.Events Namespace